<?php
include("configs/config.php");
include("configs/db.php");

$SAMPLE_USER = "นาย,สมชาย ใจดี,0001@dev,00010001,U
นางสาว,รัชนี สุขใจ,0002@dev,00020002,U
นาย,วิชัย ประสาน,0003@dev,00030003,U
นางสาว,สุดใจ สวยสม,0004@dev,00040004,U
นาย,ณัฐชา ศรีสุข,0005@dev,00050005,U
นางสาว,วราภรณ์ สุขใจ,0006@dev,00060006,U
นาย,วรวัฒน์ รักษา,0007@dev,00070007,U
นางสาว,ทิพย์รดา พิมพ์ชนะ,0008@dev,00080008,U
นาย,พีระ ทำดี,0009@dev,00090009,U
นางสาว,พรรณวดี สุขสวัสดิ์,0010@dev,00100010,U
นาย,ธนกฤต ศรีสุข,0011@dev,00110011,U
นางสาว,สุวรรณ ดีใจ,0012@dev,00120012,U
นาย,สิทธิพล สุขใจ,0013@dev,00130013,U
นางสาว,รักษา ทรงดี,0014@dev,00140014,U
นาย,วีระ ประสาน,0015@dev,00150015,U
นางสาว,ณิชา สุขสวัสดิ์,0016@dev,00160016,U
นาย,สิทธิ์ มีดี,0017@dev,00170017,U
นางสาว,สุวรรณ ทำดี,0018@dev,00180018,U
นาย,วัฒนา ประสาน,0019@dev,00190019,U
นางสาว,ประภา ดีใจ,0020@dev,00200020,U
นาย,สุชาติ สุขสวัสดิ์,0021@dev,00210021,U
นางสาว,อรทัย สวยสม,0022@dev,00220022,U
นาย,ณัฐพล ทำดี,0023@dev,00230023,U
นางสาว,พรทิพย์ รักษา,0024@dev,00240024,U
นาย,สุรชัย ดีใจ,0025@dev,00250025,U
นางสาว,สาวิตรี สุขสวัสดิ์,0026@dev,00260026,U
นาย,สุรเดช ประสาน,0027@dev,00270027,U
นางสาว,สุดใจ สวยสม,0028@dev,00280028,U
นาย,วิทย์ มีดี,0029@dev,00290029,U
นางสาว,ประภาพร ทำดี,0030@dev,00300030,U
นาย,สมบูรณ์ รักษา,0031@dev,00310031,U
นางสาว,วารี สวยสม,0032@dev,00320032,U
นาย,ศุภชัย ดีใจ,0033@dev,00330033,U
นางสาว,ณัฐภา สุขสวัสดิ์,0034@dev,00340034,U
นาย,ประสิทธิ์ ประสาน,0035@dev,00350035,U
นางสาว,วราภรณ์ ทำดี,0036@dev,00360036,U
นาย,สุกฤษฏิ์ สุขใจ,0037@dev,00370037,U
นางสาว,สุวรรณ รักษา,0038@dev,00380038,U
นาย,ธนวรรธน์ ดีใจ,0039@dev,00390039,U
นางสาว,ทรายทอง สวยสม,0040@dev,00400040,U
นาย,วุฒิ ทำดี,0041@dev,00410041,U
นางสาว,อรทัย สุขสวัสดิ์,0042@dev,00420042,U
นาย,ศิริชัย ประสาน,0043@dev,00430043,U
นางสาว,ณิชา ทำดี,0044@dev,00440044,U
นาย,สมพร รักษา,0045@dev,00450045,U
นางสาว,สุนิตา ดีใจ,0046@dev,00460046,U
นาย,สุรชัย ทำดี,0047@dev,00470047,U
นางสาว,ศรีวรรณ สุขสวัสดิ์,0048@dev,00480048,U
นาย,พิชญ์ สุขใจ,0049@dev,00490049,U
นางสาว,พรทิพย์ ทำดี,0050@dev,00500050,U
นาย,สุรพล ประสาน,0051@dev,00510051,U
นางสาว,สุภาพร สวยสม,0052@dev,00520052,U
นาย,ณัฐวุฒิ ดีใจ,0053@dev,00530053,U
นางสาว,รักษา ทำดี,0054@dev,00540054,U
นาย,สิทธิเดช สุขสวัสดิ์,0055@dev,00550055,U
นางสาว,สุดใจ สวยสม,0056@dev,00560056,U
นาย,วัชระ ทำดี,0057@dev,00570057,U
นางสาว,พรรณวดี รักษา,0058@dev,00580058,U
นาย,ณัฐพล สุขใจ,0059@dev,00590059,U
นางสาว,สุวรรณ ทำดี,0060@dev,00600060,U
นาย,ธนาธร ประสาน,0061@dev,00610061,U
นางสาว,ณิชา ทรงดี,0062@dev,00620062,U
นาย,สุชาติ ดีใจ,0063@dev,00630063,U
นางสาว,อรทัย รักษา,0064@dev,00640064,U
นาย,สุพล ทำดี,0065@dev,00650065,U
นางสาว,รัตนาวลี สุขสวัสดิ์,0066@dev,00660066,U
นาย,สุรเดช ประสาน,0067@dev,00670067,U
นางสาว,สุดใจ รักษา,0068@dev,00680068,U
นาย,วีระ ทำดี,0069@dev,00690069,U
นางสาว,ณัฐณิชา สวยสม,0070@dev,00700070,U
นาย,สุรชัย สุขใจ,0071@dev,00710071,U
นางสาว,วารี ทำดี,0072@dev,00720072,U
นาย,ธนวรรธน์ ดีใจ,0073@dev,00730073,U
นางสาว,พรทิพย์ สวยสม,0074@dev,00740074,U
นาย,สุกฤษฏิ์ ทำดี,0075@dev,00750075,U
นางสาว,สุวรรณ รักษา,0076@dev,00760076,U
นาย,ศิริชัย ดีใจ,0077@dev,00770077,U
นางสาว,ณิชา ทำดี,0078@dev,00780078,U
นาย,สมพร รักษา,0079@dev,00790079,U
นางสาว,สุนิตา ดีใจ,0080@dev,00800080,U
นาย,สุรชัย ทำดี,0081@dev,00810081,U
นางสาว,ศรีวรรณ รักษา,0082@dev,00820082,U
นาย,พิชญ์ สุขใจ,0083@dev,00830083,U
นางสาว,พรทิพย์ ทำดี,0084@dev,00840084,U
นาย,สุรพล ประสาน,0085@dev,00850085,U
นางสาว,สุภาพร สวยสม,0086@dev,00860086,U
นาย,ณัฐวุฒิ ดีใจ,0087@dev,00870087,U
นางสาว,รักษา ทำดี,0088@dev,00880088,U
นาย,สิทธิเดช สุขสวัสดิ์,0089@dev,00890089,U
นางสาว,สุดใจ สวยสม,0090@dev,00900090,U
นาย,วัชระ ทำดี,0091@dev,00910091,U
นางสาว,พรรณวดี รักษา,0092@dev,00920092,U
นาย,ณัฐพล สุขใจ,0093@dev,00930093,U
นางสาว,สุวรรณ ทำดี,0094@dev,00940094,U
นาย,ธนาธร ประสาน,0095@dev,00950095,U
นางสาว,ณิชา ทรงดี,0096@dev,00960096,U
นาย,สุชาติ ดีใจ,0097@dev,00970097,U
นางสาว,อรทัย รักษา,0098@dev,00980098,U
นาย,สุพล ทำดี,0099@dev,00990099,U
นางสาว,รัตนาวลี สุขสวัสดิ์,0100@dev,01000100,U";

// account_upload_CSV($conn, $SAMPLE_USER);

// $r = $conn->query("DELETE FROM user WHERE ID BETWEEN 7 AND 108");

// foreach ($r as $v) {
// print_r($v);
// echo '<br>';
// }

function history_upload_MAKE(mysqli $conn, int $length, int $min_id, int $max_id)
{
    $__PURPOSE_SET = array("ตัดต่อวิดีโอ", "ทำการบ้าน", "เขียนเอกสาร", "จัดการข้อมูล");
    $__DURATION_SET = array("30", "60", "120");

    $VALUE = "";

    $_T = 0;
    $_M = 0;

    for ($i = 0; $i < $length; $i++) {
        $_ID = rand($min_id, $max_id);
        $_PURPOSE = $__PURPOSE_SET[rand(0, count($__PURPOSE_SET) - 1)];
        $_DURATION = $__DURATION_SET[rand(0, count($__DURATION_SET) - 1)];

        $_NUMBER = rand(1, get_config($conn, "table_count"));

        if ($_T >= 24) $_T = 0;
        else $_T++;

        if ($_M >= 40) $_M = 0;
        else $_M += 29;

        $TODAY = date("Y-m-d");

        $__START = new DateTime("$_T:$_M:00");
        $START = $__START->format("H:i:s");

        $__END = new DateTime("$_T:$_M:00");
        $__END = $__END->add(new DateInterval("PT{$_DURATION}M"));
        $END = $__END->format("H:i:s");

        $_QUERY = "('$_ID', '$_NUMBER', '$TODAY', '$START', '$END', '$_PURPOSE', '$_DURATION'),";
        $VALUE .= $_QUERY;
    }

    $VALUE = rtrim($VALUE, ",");
    $conn->query("INSERT INTO history(`user`, `number`, `date`, `start`, `end`, `purpose`, `duration`) VALUES $VALUE");
}


// history_upload_MAKE($conn, 500, 109, 208);
